Repository: TobyBoyne/gf2-software
Catalog: locale/*/LC_MESSAGES/messages_gr.po
Languages: el

source: &📁 Open File Ctrl+O
el: &📁 Άνοιγμα αρχείου Ctrl+O

source: &🔃 Reload File Ctrl+R
el: &🔃 Επαναφόρτωση αρχείου Ctrl+R

source: &… Show Description Ctrl+D
el: &... Περιγραφή Ctrl+D

source: &💾 Save Monitor Graphs Ctrl+S
el: &💾 Αποθήκευση γραφημάτων Ctrl+S

source: &❌ Exit Ctrl+Q
el: &❌ Έξοδος Ctrl+Q

source: &File
el: &Αρχείο

source: &! Commands Ctrl+Shift+C
el: &! Εντολές Ctrl+Shift+C

source: &Help
el: & Βοήθεια

source: &◑ Toggle Dark Mode Ctrl+T
el: &◑ Εναλλαγή σκοτεινής λειτουργίας Ctrl+T

source: &⎍ Modify Monitor Trace Settings
el: &⎍ Τροποποίηση ρυθμίσεων παρακολούθησης

source: &Settings
el: &Ρυθμίσεις

source: Reset Canvas
el: Επαναφορά καμβά

source: Cycles
el: Κύκλοι

source: Run
el: Τρέξε

source: Continue
el: Συνέχισε

source: Toggle Switches ☐=0, ☑=1
el: Εναλλαγή Διακοπτών ☐=0, ☑=1

source: An error occured while loading the switches
el: Παρουσιάστηκε σφάλμα κατά τη φόρτωση των διακοπτών

source: Toggle Switches
el: Εναλλαγή Διακοπτών

source: Toggle Monitors ☐=off, ☑=on
el: Εναλλαγή οθονών ☐=off, ☑=on

source: An error occured while loading the monitors
el: Παρουσιάστηκε σφάλμα κατά τη φόρτωση των διακοπτών

source: Monitor Toggles
el: Παρακολούθησε τους διακόπτες

source: Connections
el: Συνδέσεις

source: Logic Simulator Created by Mojisola Agboola 2017 Group 19 - im475 --- tjad2 --- tjb94 2022
el: Logic Simulator Δημιουργήθηκε από τον Mojisola Agboola 2017 Group 19 - im475 --- tjad2 --- tjb94 2022

source: Please input the filepath you would like to save the image to The default extension is .jpg
el: Εισαγάγετε τη διαδρομή αρχείου στην οποία θέλετε να αποθηκεύσετε την εικόνα Η προεπιλεγμένη επέκταση είναι .jpg

source: Description File
el: Αρχείο Περιγραφής

source: User commands: r N - run the simulation for N cycles c N - continue the simulation for N cycles s X N - set switch X to N (0 or 1) m X - set a monitor on signal X z X - zap the monitor on signal X h - help (this command) q - quit the program
el: Εντολές χρήστη: r N - εκτελέστε την προσομοίωση για N κύκλους c N - συνεχίστε την προσομοίωση για N κύκλους s X N - ρυθμίστε το διακόπτη X στο N (0 ή 1) m X - ρυθμίστε μια οθόνη στο σήμα X z X - ακουμπήστε την οθόνη στο σήμα X h - help (αυτή η εντολή) q - τερματίστε το πρόγραμμα

source: Change Monitor Trace Settings
el: Αλλάξτε τις ρυθμίσεις παρακολούθησης

source: New spin control value:
el: Νέα τιμή ελέγχου περιστροφής:

source: Run button pressed.
el: Το κουμπί Τρέξε πατήθηκε.

source: Continue button pressed.
el: Το κουμπί Συνέχισε πατήθηκε.

source: has been changed from
el: έχει αλλάξει από

source: to
el: σε

source: Successfully set switch.
el: Ο διακόπτης ρυθμίστηκε με επιτυχία.

source: Error! Invalid switch.
el: Σφάλμα! Λανθασμένος διακόπτης

source: The signal
el: Το σήμα

source: is no longer monitored
el: δεν παρακολουθείται πλέον

source: Monitor removed successfully.
el: Η παρακολούθηση αφαιρέθηκε με επιτυχία

source: Error! Invalid monitor.
el: Σφάλμα! Λανθασμένη παρακολούθηση.

source: is now being monitored
el: παρακολουθείται

source: Monitor added successfully.
el: Η παρακολούθηση προστέθηκε με επιτυχία

source: Error! Invalid monitor output.
el: Σφάλμα! Λανθασμένη έξοδος οθόνης

source: Error! Can't find the device to monitor.
el: Λάθος! Δεν είναι δυνατή η εύρεση της συσκευής για παρακολούθηση.

source: Error! This signal is already monitored.
el: Σφάλμα! Αυτό το σήμα είναι ήδη υπό παρακολούθηση.

source: Something has gone wrong: the monitor list doesn't seem to be reading correctly.
el: Κάτι πήγε στραβά: η λίστα παρακολούθησης δεν φαίνεται να διαβάζει σωστά.

source: now connected to
el: ενώθηκε με

source: , not
el: , δεν

source: One or more inputs in the network are missing a connection
el: Μία ή περισσότερες εισόδοι στο δίκτυο δεν έχουν σύνδεση

source: Invalid command. Enter 'h' for help.
el: Άκυρη εντολή. Πληκτρολογήστε 'h' για βοήθεια.

source: This function has not been implemented yet. Enter 'h' for help.
el: Αυτή η λειτουργία δεν έχει εφαρμοστεί ακόμα. Πληκτρολογήστε 'h' για βοήθεια.

source: Error! Expected a name.
el: Σφάλμα! Αναμενόταν ένα όνομα.

source: Error! Unknown name.
el: Σφάλμα! Άγνωστο όνομα.

source: Error! Expected a number.
el: Σφάλμα! Αναμενόταν ένας αριθμός.

source: Number out of range.
el: Ο αριθμός είναι εκτός ορίων.

source: User commands:
el: Εντολές χρήστη:

source: r N - run the simulation for N cycles
el: r N - εκτελέστε την προσομοίωση για N κύκλους

source: c N - continue the simulation for N cycles
el: c N - συνεχίστε την προσομοίωση για N κύκλους

source: s X N - set switch X to N (0 or 1)
el: s X N - ρυθμίστε το διακόπτη X στο N (0 ή 1)

source: m X - set a monitor on signal X
el: m X - ρυθμίστε μια οθόνη στο σήμα X

source: z X - zap the monitor on signal X
el: z X - ακουμπήστε την οθόνη στο σήμα X

source: h - help (this command)
el: h - help (αυτή η εντολή)

source: q - quit the program
el: q - τερματίστε το πρόγραμμα

source: Successfully made monitor.
el: Η οθόνη έγινε με επιτυχία.

source: Error! Could not make monitor.
el: Σφάλμα! Η οθόνη δεν δημιουργήθηκε.

source: Successfully zapped monitor
el: Η παρακολούθηση αφαιρέθηκε με επιτυχία

source: Error! Could not zap monitor.
el: Σφάλμα! Η οθόνη δεν αφαιρέθηκε.

source: Error! Network oscillating.
el: Σφάλμα! Το δίκτυο πάλλεται.

source: Invalid number of cycles (must be integer). Enter 'h' for help.
el: Μη έγκυρος αριθμός κύκλων (πρέπει να είναι ακέραιος). Πληκτρολογήστε 'h' για βοήθεια.

source: Running for
el: Τρέχει για

source: cycles
el: κύκλους

source: Error! Nothing to continue. Run first.
el: Σφάλμα! Πρώτα Τρέξε το πρόγραμμα.

source: Continuing for
el: Συνεχίζει για

source: cycles.
el: κύκλους

source: Total:
el: Σύνολο:

source: Connection successfully made
el: Η σύνδεση δημιουργήθηκε με επιτυχία

source: ERROR: Device not found
el: ΣΦΑΛΜΑ: Η συσκευή δεν βρέθηκε

source: ERROR: Input already connected to another port
el: ΣΦΑΛΜΑ: Η είσοδος είναι ήδη συνδεδεμένη σε άλλη θύρα

source: ERROR: Inputs can't be connected to other inputs
el: ΣΦΑΛΜΑ: Οι εισόδοι δεν μπορούν να συνδεθούν με άλλες εισόδους

source: ERROR: Not a valid input or output port
el: ΣΦΑΛΜΑ: Η θύρα εισόδου ή εξόδου δεν είναι έγκυρη

source: ERROR: Outputs can't be connected to other outputs
el: ΣΦΑΛΜΑ: Οι εξόδοι δεν μπορούν να συνδεθούν με άλλες εξόδους

source: ERROR: Those ports weren't connected
el: ΣΦΑΛΜΑ: Οι θύρες δεν έχουν συνδεθεί

source: Network is complete and ready to run.
el: Το δίκτυο είναι πλήρες και έτοιμο για λειτουργία.

source: One or more inputs in the network are missing a connection.
el: Μία ή περισσότερες εισόδοι στο δίκτυο δεν έχουν συνδεθεί.

source: Connection successfully cut
el: Η σύνδεση διακόπηκε με επιτυχία

source: Network is incomplete, please connect something to the disconnected input before running.
el: Το δίκτυο δεν είναι ολοκληρωμένο, συνδέστε κάτι στην αποσυνδεδεμένη είσοδο πριν τρέξει.

source: Monitor trace height
el: Παρακολούθηση ύψους ίχνους

source: Monitor trace time step horizontal spacing
el: Παρακολούθηση οριζόντιας απόστασης χρόνου

source: Vertical spacing between traces
el: Κάθετη απόσταση μεταξύ των ιχνών

source: Apply
el: Εφάρμοσε

source: Close
el: Κλείσε

source: Updated settings
el: Ενημέρωση ρυθμίσεις
